podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/DMAMUX0_16CH_TRIG_S32K14x.svd.xml
<!--
Devices using this peripheral: 
      S32K142
      S32K144
      S32K146
      S32K148
-->
      <peripheral>
         <?sourceFile "DMAMUX0_16CH_TRIG_S32K14x" ?>
         <name>DMAMUX0</name>
         <description>DMA channel multiplexor</description>
         <groupName>DMAMUX</groupName>
         <headerStructName>DMAMUX</headerStructName>
         <baseAddress>0x40021000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <?width "8" ?>
            <offset>0x0</offset>
            <size>0x10</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <dim>16</dim>
               <dimIncrement>1</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimIndex>
               <name>CHCFG%s</name>
               <description>Channel Configuration Register</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>SOURCE</name>
                     <description>DMA Channel Source (slot)\n
Specifies which DMA source, if any, is routed to a particular DMA channel</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>Disabled</name>
                           <description>Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENET</name>
                           <description>ENET</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPUART0_Rx</name>
                           <description>LPUART0_Rx</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPUART0_Tx</name>
                           <description>LPUART0_Tx</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPUART1_Rx</name>
                           <description>LPUART1_Rx</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPUART1_Tx</name>
                           <description>LPUART1_Tx</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPUART2_Rx</name>
                           <description>LPUART2_Rx</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPUART2_Tx</name>
                           <description>LPUART2_Tx</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPI2C1_Rx</name>
                           <description>LPI2C1_Rx</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPI2C1_Tx</name>
                           <description>LPI2C1_Tx</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FLEXIO_Sh0</name>
                           <description>FLEXIO_Sh0</description>
                           <value>10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FLEXIO_Sh1</name>
                           <description>FLEXIO_Sh1</description>
                           <value>11</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FLEXIO_Sh2</name>
                           <description>FLEXIO_Sh2</description>
                           <value>12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FLEXIO_Sh3</name>
                           <description>FLEXIO_Sh3</description>
                           <value>13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPSPI0_Rx</name>
                           <description>LPSPI0_Rx</description>
                           <value>14</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPSPI0_Tx</name>
                           <description>LPSPI0_Tx</description>
                           <value>15</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPSPI1_Rx</name>
                           <description>LPSPI1_Rx</description>
                           <value>16</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPSPI1_Tx</name>
                           <description>LPSPI1_Tx</description>
                           <value>17</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPSPI2_Rx</name>
                           <description>LPSPI2_Rx</description>
                           <value>18</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPSPI2_Tx</name>
                           <description>LPSPI2_Tx</description>
                           <value>19</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FTM1_Ch0</name>
                           <description>FTM1_Ch0</description>
                           <value>20</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FTM1_Ch1</name>
                           <description>FTM1_Ch1</description>
                           <value>21</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FTM1_Ch2</name>
                           <description>FTM1_Ch2</description>
                           <value>22</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FTM1_Ch3</name>
                           <description>FTM1_Ch3</description>
                           <value>23</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FTM1_Ch4</name>
                           <description>FTM1_Ch4</description>
                           <value>24</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FTM1_Ch5</name>
                           <description>FTM1_Ch5</description>
                           <value>25</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FTM1_Ch6</name>
                           <description>FTM1_Ch6</description>
                           <value>26</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FTM1_Ch7</name>
                           <description>FTM1_Ch7</description>
                           <value>27</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FTM2_Ch0</name>
                           <description>FTM2_Ch0</description>
                           <value>28</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FTM2_Ch1</name>
                           <description>FTM2_Ch1</description>
                           <value>29</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FTM2_Ch2</name>
                           <description>FTM2_Ch2</description>
                           <value>30</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FTM2_Ch3</name>
                           <description>FTM2_Ch3</description>
                           <value>31</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FTM2_Ch4</name>
                           <description>FTM2_Ch4</description>
                           <value>32</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FTM2_Ch5</name>
                           <description>FTM2_Ch5</description>
                           <value>33</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FTM2_Ch6</name>
                           <description>FTM2_Ch6</description>
                           <value>34</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FTM2_Ch7</name>
                           <description>FTM2_Ch7</description>
                           <value>35</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FTM0_Or</name>
                           <description>FTM0_Or</description>
                           <value>36</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FTM3_Or</name>
                           <description>FTM3_Or</description>
                           <value>37</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FTM4_Or</name>
                           <description>FTM4_Or</description>
                           <value>38</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FTM5_Or</name>
                           <description>FTM5_Or</description>
                           <value>39</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FTM6_Or</name>
                           <description>FTM6_Or</description>
                           <value>40</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FTM7_Or</name>
                           <description>FTM7_Or</description>
                           <value>41</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ADC0</name>
                           <description>ADC0</description>
                           <value>42</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ADC1</name>
                           <description>ADC1</description>
                           <value>43</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPI2C0_Rx</name>
                           <description>LPI2C0_Rx</description>
                           <value>44</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPI2C0_Tx</name>
                           <description>LPI2C0_Tx</description>
                           <value>45</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PDB0</name>
                           <description>PDB0</description>
                           <value>46</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PDB1</name>
                           <description>PDB1</description>
                           <value>47</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CMP0</name>
                           <description>CMP0</description>
                           <value>48</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PORTA</name>
                           <description>PORTA</description>
                           <value>49</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>POSRTB</name>
                           <description>POSRTB</description>
                           <value>50</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PORTC</name>
                           <description>PORTC</description>
                           <value>51</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PORTD</name>
                           <description>PORTD</description>
                           <value>52</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PORTE</name>
                           <description>PORTE</description>
                           <value>53</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CAN0</name>
                           <description>CAN0</description>
                           <value>54</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CAN1</name>
                           <description>CAN1</description>
                           <value>55</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CAN2</name>
                           <description>CAN2</description>
                           <value>56</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SAI0_Rx</name>
                           <description>SAI0_Rx</description>
                           <value>57</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SAI0_tx</name>
                           <description>SAI0_tx</description>
                           <value>58</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPTMR0</name>
                           <description>LPTMR0</description>
                           <value>59</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>QUADSPI_Rx</name>
                           <description>QUADSPI_Rx</description>
                           <value>60</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>QUADSPI_Tx</name>
                           <description>QUADSPI_Tx</description>
                           <value>61</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AlwaysEnabled62</name>
                           <description>AlwaysEnabled62</description>
                           <value>62</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AlwaysEnabled63</name>
                           <description>AlwaysEnabled63</description>
                           <value>63</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRIG</name>
                     <description>DMA Channel Trigger Enable\n
Enables the periodic trigger capability for the triggered DMA channel</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Request directly routed</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Periodic triggering enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ENBL</name>
                     <description>DMA Channel Enable\n
Usually the Channel enable in the DMA is used in preference to this</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Channel disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Channel enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
